In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
sampleData = [("bob","Developer",None),("mark","Developer",125000),("bob","Developer",None),("peter","Developer",185000),("jon","Tester",65000),("jon","Tester",65000),("simon","Developer",98000),("eric","Developer",85000),("henry","Developer",110000)]

df1 = spark.createDataFrame(sampleData, schema=["Name","Role","Account_Balance"])
df1.show()

+-----+---------+---------------+
| Name|     Role|Account_Balance|
+-----+---------+---------------+
|  bob|Developer|           null|
| mark|Developer|         125000|
|  bob|Developer|           null|
|peter|Developer|         185000|
|  jon|   Tester|          65000|
|  jon|   Tester|          65000|
|simon|Developer|          98000|
| eric|Developer|          85000|
|henry|Developer|         110000|
+-----+---------+---------------+

In [3]:
med = df1.approxQuantile("Account_Balance", [0.5], 0.25)
med

[98000.0]

In [4]:
df1.select("Name","Role","Account_Balance").dropDuplicates().show()

+-----+---------+---------------+
| Name|     Role|Account_Balance|
+-----+---------+---------------+
|simon|Developer|          98000|
|  bob|Developer|           null|
|  jon|   Tester|          65000|
| mark|Developer|         125000|
| eric|Developer|          85000|
|henry|Developer|         110000|
|peter|Developer|         185000|
+-----+---------+---------------+

In [5]:
sampleData = [("bob","Developer",None),("mark","Developer",125000),("bob","Developer",None),("peter","Developer",185000),("jon","Tester",65000),("jon","Tester",65000),("simon","Developer",98000),("eric","Developer",85000),("henry","Developer",110000)]

df1 = spark.createDataFrame(sampleData, schema=["Name","Role","Account_Balance"])
df1.show()

sampleData2 = [("Developer",6000),("Tester",4500)]

df2 = spark.createDataFrame(sampleData2, schema=["Role","Salary"])
df2.show()

+-----+---------+---------------+
| Name|     Role|Account_Balance|
+-----+---------+---------------+
|  bob|Developer|           null|
| mark|Developer|         125000|
|  bob|Developer|           null|
|peter|Developer|         185000|
|  jon|   Tester|          65000|
|  jon|   Tester|          65000|
|simon|Developer|          98000|
| eric|Developer|          85000|
|henry|Developer|         110000|
+-----+---------+---------------+

+---------+------+
|     Role|Salary|
+---------+------+
|Developer|  6000|
|   Tester|  4500|
+---------+------+

In [6]:
df1 = pd.DataFrame({'Name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'role': ['Developer', 'Tester', 'Tester', 'Developer'],
                   'Account_Balance': [125000, 85000, 90000,145000]})

df2 = pd.DataFrame({'Name': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'Salary': [5000, 3500, 4000, 6000]})

In [7]:
result = pd.merge(df1,
                 df2[['Name', 'Salary']],
                 on='Name')
result.head()

   Name       role  Account_Balance  Salary
0   Bob  Developer           125000    3500
1  Jake     Tester            85000    4000
2  Lisa     Tester            90000    5000
3   Sue  Developer           145000    6000

In [8]:
from pyspark.sql.functions import rand

In [9]:
result.corr()

                 Account_Balance    Salary
Account_Balance         1.000000  0.412682
Salary                  0.412682  1.000000

In [10]:
result.cov()

                 Account_Balance        Salary
Account_Balance     8.229167e+08  1.312500e+07
Salary              1.312500e+07  1.229167e+06